[
    {
        "name": "Fibre Reinforcement ",
        "level": 5,
        "content": "Senthilkumar, S.R.R., and Natesan, S.C., “Effect of Fibre Reinforcement on Restrained Shrinkage Cracking of Cementitious Composites”, Proceedings of the International Conference on Recent Trends in Concrete Technology and Structures, D.L. Venkatesh Babu, et al. (Eds.), Kumaraguru College of Technology, Coimbatore, Tamilnadu, India, Vol.2, September 2003, pp. 427 - 436."
    },
    {
        "name": "Model to Predict Plastic Shrinkage",
        "level": 5,
        "content": "Senthilkumar, S.R.R., and Natesan, S.C., “Model to Predict Plastic Shrinkage Cracking of Fibre Reinforced Concrete”, Proceedings of ICFRC International Conference on Fibre Composites, High Performance Concretes and Smart Materials, V.S. Parameswaran, (Ed.), Chennai, Tamilnadu, India, Vol. 1, January 2004, pp. 257 - 272."
    },
    {
        "name": "Prevention of Plastic Shrinkage ",
        "level": 4,
        "content": "Senthilkumar, S.R.R., and Natesan, S.C., “Prediction and Prevention of Plastic Shrinkage Cracking of Cementitious Composites”, Proceedings of International Conference on “Our World in Concrete and Structures – OW04”, held at Hotel New Otani, Singapore, August 2004, pp. 451-460."
    },
    {
        "name": "Waste Prognosis",
        "level": 4,
        "content": "Nithya, R., Senthilkumar, S.R.R., and Velumani, A., “A study on Waste Prognosis based on Socio-Economic indicators using Artificial Neural Network in India”, Proceedings of International Conference and Exhibition on Solid Waste and Environment, “ANSWAI CONF-2009”,  held at Anna University Coimbatore, India, during August 2009."
    },
    {
        "name": "Modelling Elastic Modulus ",
        "level": 4,
        "content": "Alfin Ashmita, F., Senthilkumar, S.R.R., Chithra, S., and Chinnaraju, K., “Modelling Elastic Modulus of High Performance Concrete Using Artificial Neural Networks” Presented in  International Conference on Explorations & Innovations in Engineering and Technology ICEIET – 2016 conducted by Hindusthan Institute of Technology, Coimbatore on 18.3.2016 and 19.3.2016."
    },
    {
        "name": "Recycled Coarse Aggregate",
        "level": 4,
        "content": "Seethapathi, M., Senthilkumar, S.R.R., and Chinnaraju, K., “Study On Properties of Self Compacting Concrete Using Recycled Coarse Aggregate” in “Innovation and Advances In Civil Engineering Towards Green and Sustainable Systems”, presented in International Conference organized by Coimbatore Institute of Technology, Coimbatore during 28-30  April 2014."
    },
    {
        "name": "Application of Eco Sand ",
        "level": 5,
        "content": "Seethapathi, M., Senthilkumar, S.R.R., and Chinnaraju, K., “Study on Application of Eco Sand in Self Compacting Concrete” in “Sustainable Practices in Civil Engineering”,  presented in International Conference organized by K.P.R. Institute of Technology, Coimbatore during 16 – 18 of April 2015."
    },
    {
        "name": "Fly Ash ",
        "level": 5,
        "content": "Seethapathi, M., Senthilkumar, S.R.R., and Chinnaraju, K., “Study On Fly Ash Based Self Compacting Concrete With Aggregate Replacements” in “Engineering Technology and Sciences”, presented in International Conference organized by Muthayammal Engineering Institutions, Nammakkal  on 18 & 19 March 2016."
    },
    {
        "name": "ABAQUS",
        "level": 5,
        "content":
            "Prabhu, S., Chithra, S., Senthilkumar, S.R.R., Chinnaraju, K., and Chithra, R. “Analytical Study on the behaviour of High Performance Concrete beam by Partially Replacing Natural Sand with Copper Slag using ABAQUS” in 1st International Conference on Advanced Engineering and Technology for Sustainable Development (AETSD) 2015 conducted by Karpagam College of Engineering, Coimbatore on 05.03.2015 and 06.03.2015."
    },
    {
        "name": "GIS",
        "level": 5,
        "content":
            "Nithya, R., Senthilkumar, S.R.R., and Velumani, A., “Location of Collection Bins Using GIS in Coimbatore City”, Proceedings of National Conference, held at Government College of Technology, Coimbatore,  India, during 23-24, March 2011."
    },
    {
        "name": "Silica Fume and Nano Silica",
        "level": 4,
        "content": "Kamalakannan, P., Chithra, S., Senthilkumar, S.R.R., and Chinnaraju, K., “Workability and Strength Comparison of High Performance Concrete containing Silica Fume and Nano Silica”, presented in the TEQIP sponsored National Conference on ‘Research Congress in Civil Engineering - RCCE 14’ held at Government College of Technology, Coimbatore during 17th  April 2013."
    },
    {
        "name": "Nano Silica",
        "level": 4,
        "content": "Saravanan, B., Chithra, S., Senthilkumar, S.R.R., and Chinnaraju, K.,  “Preparation of Nano Silica using Sol-Gel method and to compare the properties of Cement Mortar incorporating Silica Fume and NanoSilica” presented in National conference on ‘Recent Innovations in Structures and Environment - RISE 14’ held at Alagappa Chettiar College of Engineering and Technology, Karaikudi during 28th  May 2014."
    },
    {
        "name": "Machine Learning Algorithm ",
        "level": 4,
        "content": "Senthilkumar, S.R.R., “Application of Machine Learning Algorithm for Reinforcement details in Structural Members” presented in 10th National Conference on ‘Innovation in Concrete and Constructions – ICON’23 organized by Sona College of Technology on 10th May 2023."
    },
    {
        "name": "Virtual Reality ",
        "level": 5,
        "content":
            "Senthilkumar, S.R.R., “Application of Virtual Reality Took for Building” presented in 10th National Conference on ‘Innovation in Concrete and Constructions – ICON’23 organized by Sona College of Technology on 10th May 2023."
    },
    {
        "name": "Educational Institutions",
        "level": 5,
        "content":
            "Senthilkumar S.R.R., Implementation of NEP – 2020 “Challenges and Opportunities for Educational Institutions” presented in the National Conference organized by Education Promotion Society for India, November 30, 2021."
    },
    {
        "name": "Hybrid Fibre ",
        "level": 4,
        "content":
            "Mukesh, s., Chithra, S., Senthilkumar, S.R.R., Chinnaraju, K., Chithra, R., “Prediction of slump flow of Hybrid Fibre Reinforced High Performance Concrete” in the TEQIP-II Sponsored National Conference on “Materials and Technologies for Sustainable Infrastructure (MTSI ’16)” conducted by Department of Civil Engineering (S), Government College of Technology, Coimbatore on 29.04.2016 and 30.04.2016."
    },
    {
        "name": "Prediction of flexural strength ",
        "level": 5,
        "content":
            "Alfin Ashmita, F., Chithra, S., Senthilkumar, S.R.R., Chinnaraju, K., presented a paper on “Prediction of flexural strength of High Performance Concrete with copper slag and micro/nano silica particles” in the TEQIP-II Sponsored National Conference on “Materials and Technologies for Sustainable Infrastructure (MTSI ’16)” conducted by Department of Civil Engineering (S), Government College of Technology, Coimbatore on 29.04.2016 and 30.04.2016."
    },
    {
        "name": "Self Compacting Concrete",
        "level": 4,
        "content":
            "Seethapathi, M., Senthilkumar, S.R.R., and Chinnaraju, K., “Experimental Study on High Performance Self Compacting Concrete” in “Advances in Concrete and Construction Technology”, presented in National Conference organized by K.S.R. College of Engineering, Thiruchengode during 19 – 20 of April 2012."
    },
    {
        "name": "copper slag ",
        "level": 5,
        "content": "Elangovan, P., Chithra, S., and Senthilkumar, S.R.R., “Experimental study on the effect of copper slag as a fine aggregate on the properties of High Performance Cement Mortar cubes” presented in the ‘National Conference on Recent Advancements in Geotechnical – NCRAG 2012’ held at Government College of Technology, Coimbatore during 20th  April 2012. "
    },
    {
        "name": "Demolished Concrete",
        "level": 5,
        "content": "Senthilkumar, S.R.R., Vijaya Kumar, K., and Gnanavelu, P., “Experimental Study on Recycling of Demolished Concrete”, Proceedings of the 19th National Convention of Architectural Engineers (AEC – 2003), organized by Department of  Architecture & Panning, MANIT, Bhopal, India, November 2003."
    }
]
